Repository: AlaaGitHub2020/todo_board
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Welcome to ToDo Board App! Please sign in to continue.
ar: مرحبًا بك في تطبيق ToDo Board! من فضلك سجل دخولك للمتابعة.

source: Welcome to ToDo Board App! Please create an account to continue
ar: مرحبًا بك في تطبيق ToDo Board! الرجاء إنشاء حساب للمتابعة

source: By signing in, you agree to our terms and conditions.
ar: من خلال تسجيل الدخول ، فإنك توافق على الشروط والأحكام الخاصة بنا.

source: By registering, you agree to our terms and conditions.
ar: بالتسجيل ، فإنك توافق على الشروط والأحكام الخاصة بنا.

source: English
ar: إنجليزي

source: Arabic
ar: عربي

source: Required
ar: مطلوب

# passwordMinimumLength
source: A password must have a minimum length of 8.
ar: يجب ألا يقل طول كلمة المرور عن 8.

# passwordsNotMatched
source: Passwords did not match
ar: كلمات المرور غير متطابقة

source: Save
ar: حفظ

source: Type a task description
ar: اكتب وصف مهمة

# invalidFirebaseStringValue
source: Invalid String Value
ar: قيمة غير صالحة

# genericError
source: Error Happened
ar: حدث خطأ

# unexpected
source: Unexpected Error
ar: خطأ غير متوقع

# platFormServerFailure
source: Failure of the Platform Server
ar: فشل خادم النظام الأساسي

source: Insufficient Permission
ar: لا تملك إذن للوصول

source: Unable To Update
ar: غير قادر على التحديث

source: Task is empty please fill it first
ar: المهمة فارغة يرجى تعبئتها أولا

source: Unable to delete your task
ar: غير قادر على حذف مهمتك

source: Saving
ar: يتم الان الحفظ

# editTask
source: Edit the task
ar: تحرير المهمة

source: Create a task
ar: إنشاء مهمة

source: Cancel
ar: إلغاء

source: Task name
ar: اسم المهمة

source: Type your task name
ar: اكتب اسم مهمتك

source: Task description
ar: وصف المهمة

source: Add new task
ar: أضف مهمة جديدة

source: No tasks yet
ar: لا توجد مهام حتى الآن

source: Move to:
ar: الانتقال إلى:

source: Task:
ar: مهمة:

# task1
source: Task
ar: مهمة

source: Description:
ar: وصف:

source: Change priority:
ar: تغيير الأولوية:

# createdAt
source: Task created at:
ar: تم إنشاء المهمة في:

source: Task completed at:
ar: اكتملت المهمة في:

source: Select task priority:
ar: حدد أولوية المهمة:

source: Select task state:
ar: حدد حالة المهمة:

source: SignOut
ar: خروج

source: Profile
ar: الحساب التعريفي

source: Update
ar: تحديث

# youSpentThisTimeslotsOnTheTask
source: You spent these times slots on the task :
ar: لقد أمضيت هذه الفترات الزمنية في انجاز المهمة:

source: Task is not completed yet
ar: لم تكتمل المهمة بعد

# youDidNotSpendAnyTimeOnThisTaskYet
source: You didn't spend any time on this task yet
ar: لم تقضِ أي وقت في هذه المهمة حتى الآن

source: You spend:
ar: لقد امضيت:

source: at:
ar: في:

source: Completed task history
ar: تاريخ المهام المكتملة

source: No completed tasks yet
ar: لا توجد مهام مكتملة حتى الآن

source: Delete Task
ar: حذف المهمة

# areYouSure
source: Are you sure you want to delete the task "{taskName}" with its timer history?
ar: هل أنت متأكد من أنك تريد حذف المهمة "{taskName}"وتواريخ المؤقتات الخاصة بها؟

source: Delete
ar: حذف

# exportToCSV
source: Export completed tasks data to CSV
ar: تصدير بيانات المهام المكتملة إلى CSV

# exportTimerHistoryToCSV
source: Export task timer history data to CSV
ar: تصدير بيانات سجل مؤقت المهام إلى CSV

source: Dark Mode
ar: الوضع الداكن

# selectApplicationLanguage
source: Select the application language
ar: حدد لغة التطبيق

source: Language
ar: اللغة

source: Welcome
ar: مرحبا

source: User Profile
ar: ملف التعريف

# errorWithFetchingYourProfile
source: An error occurred while retrieving your profile. Please try again later!!
ar: حدث خطأ أثناء استرداد ملف التعريف الخاص بك. الرجاء معاودة المحاولة في وقت لاحق!!

source: User Name
ar: اسم المستخدم

source: Email
ar: بريد إلكتروني

source: Account Information
ar: معلومات الحساب

source: User
ar: مستخدم
